hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_adc16_regs.h
/*
 * STOP_POS (RW)
 *
 */
#define ADC16_INT_EN_STOP_POS_MASK (0x100000UL)
#define ADC16_INT_EN_STOP_POS_SHIFT (20U)
#define ADC16_INT_EN_STOP_POS_SET(x) (((uint32_t)(x) << ADC16_INT_EN_STOP_POS_SHIFT) & ADC16_INT_EN_STOP_POS_MASK)
#define ADC16_INT_EN_STOP_POS_GET(x) (((uint32_t)(x) & ADC16_INT_EN_STOP_POS_MASK) >> ADC16_INT_EN_STOP_POS_SHIFT)

/*
 * WDOG (RW)
 *
 * set if one chanel watch dog event triggered
 */
#define ADC16_INT_EN_WDOG_MASK (0xFFFFU)
#define ADC16_INT_EN_WDOG_SHIFT (0U)
#define ADC16_INT_EN_WDOG_SET(x) (((uint32_t)(x) << ADC16_INT_EN_WDOG_SHIFT) & ADC16_INT_EN_WDOG_MASK)
#define ADC16_INT_EN_WDOG_GET(x) (((uint32_t)(x) & ADC16_INT_EN_WDOG_MASK) >> ADC16_INT_EN_WDOG_SHIFT)

/* Bitfield definition for register: TRIGMUX_EN */
/*
 * SEQ_CMPT (RW)
 *
 */
#define ADC16_TRIGMUX_EN_SEQ_CMPT_MASK (0x1000000UL)
#define ADC16_TRIGMUX_EN_SEQ_CMPT_SHIFT (24U)
#define ADC16_TRIGMUX_EN_SEQ_CMPT_SET(x) (((uint32_t)(x) << ADC16_TRIGMUX_EN_SEQ_CMPT_SHIFT) & ADC16_TRIGMUX_EN_SEQ_CMPT_MASK)
#define ADC16_TRIGMUX_EN_SEQ_CMPT_GET(x) (((uint32_t)(x) & ADC16_TRIGMUX_EN_SEQ_CMPT_MASK) >> ADC16_TRIGMUX_EN_SEQ_CMPT_SHIFT)

/*
 * SEQ_CVC (RW)
 *
 */
#define ADC16_TRIGMUX_EN_SEQ_CVC_MASK (0x800000UL)
#define ADC16_TRIGMUX_EN_SEQ_CVC_SHIFT (23U)
#define ADC16_TRIGMUX_EN_SEQ_CVC_SET(x) (((uint32_t)(x) << ADC16_TRIGMUX_EN_SEQ_CVC_SHIFT) & ADC16_TRIGMUX_EN_SEQ_CVC_MASK)
#define ADC16_TRIGMUX_EN_SEQ_CVC_GET(x) (((uint32_t)(x) & ADC16_TRIGMUX_EN_SEQ_CVC_MASK) >> ADC16_TRIGMUX_EN_SEQ_CVC_SHIFT)

/*
 * STOP_POS (RW)
 *
 */
#define ADC16_TRIGMUX_EN_STOP_POS_MASK (0x100000UL)
#define ADC16_TRIGMUX_EN_STOP_POS_SHIFT (20U)
#define ADC16_TRIGMUX_EN_STOP_POS_SET(x) (((uint32_t)(x) << ADC16_TRIGMUX_EN_STOP_POS_SHIFT) & ADC16_TRIGMUX_EN_STOP_POS_MASK)
#define ADC16_TRIGMUX_EN_STOP_POS_GET(x) (((uint32_t)(x) & ADC16_TRIGMUX_EN_STOP_POS_MASK) >> ADC16_TRIGMUX_EN_STOP_POS_SHIFT)

/*
 * WDOG (RW)
 *
 */
#define ADC16_TRIGMUX_EN_WDOG_MASK (0xFFFFU)
#define ADC16_TRIGMUX_EN_WDOG_SHIFT (0U)
#define ADC16_TRIGMUX_EN_WDOG_SET(x) (((uint32_t)(x) << ADC16_TRIGMUX_EN_WDOG_SHIFT) & ADC16_TRIGMUX_EN_WDOG_MASK)
#define ADC16_TRIGMUX_EN_WDOG_GET(x) (((uint32_t)(x) & ADC16_TRIGMUX_EN_WDOG_MASK) >> ADC16_TRIGMUX_EN_WDOG_SHIFT)

/* Bitfield definition for register: TRG_CMPT_FLAG */
/*
 * TRG_CMPT_FLAG (RW1C)
 *
 */
#define ADC16_TRG_CMPT_FLAG_TRG_CMPT_FLAG_MASK (0xFFFU)
#define ADC16_TRG_CMPT_FLAG_TRG_CMPT_FLAG_SHIFT (0U)
#define ADC16_TRG_CMPT_FLAG_TRG_CMPT_FLAG_SET(x) (((uint32_t)(x) << ADC16_TRG_CMPT_FLAG_TRG_CMPT_FLAG_SHIFT) & ADC16_TRG_CMPT_FLAG_TRG_CMPT_FLAG_MASK)
#define ADC16_TRG_CMPT_FLAG_TRG_CMPT_FLAG_GET(x) (((uint32_t)(x) & ADC16_TRG_CMPT_FLAG_TRG_CMPT_FLAG_MASK) >> ADC16_TRG_CMPT_FLAG_TRG_CMPT_FLAG_SHIFT)

/* Bitfield definition for register: ANA_CTRL0 */
/*
 * MOTO_EN (RW)
 *
 * "set to enable moto_soc and moto_valid.
 * Should use AHB clock for adc, this bit can be used avoid async output"
 */
#define ADC16_ANA_CTRL0_MOTO_EN_MASK (0x80000000UL)
#define ADC16_ANA_CTRL0_MOTO_EN_SHIFT (31U)
#define ADC16_ANA_CTRL0_MOTO_EN_SET(x) (((uint32_t)(x) << ADC16_ANA_CTRL0_MOTO_EN_SHIFT) & ADC16_ANA_CTRL0_MOTO_EN_MASK)
#define ADC16_ANA_CTRL0_MOTO_EN_GET(x) (((uint32_t)(x) & ADC16_ANA_CTRL0_MOTO_EN_MASK) >> ADC16_ANA_CTRL0_MOTO_EN_SHIFT)

/*
 * ADC_CLK_ON (RW)
 *
 * set to enable adc clock to analog, Software should set this bit before access to any adc16_* register.
 * MUST set clock_period to 0 or 1 for adc16 reg access
 */
#define ADC16_ANA_CTRL0_ADC_CLK_ON_MASK (0x1000U)
#define ADC16_ANA_CTRL0_ADC_CLK_ON_SHIFT (12U)
#define ADC16_ANA_CTRL0_ADC_CLK_ON_SET(x) (((uint32_t)(x) << ADC16_ANA_CTRL0_ADC_CLK_ON_SHIFT) & ADC16_ANA_CTRL0_ADC_CLK_ON_MASK)
#define ADC16_ANA_CTRL0_ADC_CLK_ON_GET(x) (((uint32_t)(x) & ADC16_ANA_CTRL0_ADC_CLK_ON_MASK) >> ADC16_ANA_CTRL0_ADC_CLK_ON_SHIFT)

/*
 * STARTCAL (RW)
 *
 * set to start the offset calibration cycle (Active H). user need to clear it after setting it.
 */
#define ADC16_ANA_CTRL0_STARTCAL_MASK (0x4U)
#define ADC16_ANA_CTRL0_STARTCAL_SHIFT (2U)
#define ADC16_ANA_CTRL0_STARTCAL_SET(x) (((uint32_t)(x) << ADC16_ANA_CTRL0_STARTCAL_SHIFT) & ADC16_ANA_CTRL0_STARTCAL_MASK)
#define ADC16_ANA_CTRL0_STARTCAL_GET(x) (((uint32_t)(x) & ADC16_ANA_CTRL0_STARTCAL_MASK) >> ADC16_ANA_CTRL0_STARTCAL_SHIFT)

/* Bitfield definition for register: ANA_STATUS */
/*
 * CALON (RW)
 *
 * Indicates if the ADC is in calibration mode (Active H).
 */
#define ADC16_ANA_STATUS_CALON_MASK (0x80U)
#define ADC16_ANA_STATUS_CALON_SHIFT (7U)
#define ADC16_ANA_STATUS_CALON_SET(x) (((uint32_t)(x) << ADC16_ANA_STATUS_CALON_SHIFT) & ADC16_ANA_STATUS_CALON_MASK)
#define ADC16_ANA_STATUS_CALON_GET(x) (((uint32_t)(x) & ADC16_ANA_STATUS_CALON_MASK) >> ADC16_ANA_STATUS_CALON_SHIFT)

/* Bitfield definition for register array: ADC16_PARAMS */
/*
 * PARAM_VAL (RW)
 *
 */
#define ADC16_ADC16_PARAMS_PARAM_VAL_MASK (0xFFFFU)
#define ADC16_ADC16_PARAMS_PARAM_VAL_SHIFT (0U)
#define ADC16_ADC16_PARAMS_PARAM_VAL_SET(x) (((uint16_t)(x) << ADC16_ADC16_PARAMS_PARAM_VAL_SHIFT) & ADC16_ADC16_PARAMS_PARAM_VAL_MASK)
#define ADC16_ADC16_PARAMS_PARAM_VAL_GET(x) (((uint16_t)(x) & ADC16_ADC16_PARAMS_PARAM_VAL_MASK) >> ADC16_ADC16_PARAMS_PARAM_VAL_SHIFT)

/* Bitfield definition for register: ADC16_CONFIG0 */
/*
 * REG_EN (RW)
 *
 * set to enable regulator
 */
#define ADC16_ADC16_CONFIG0_REG_EN_MASK (0x1000000UL)
#define ADC16_ADC16_CONFIG0_REG_EN_SHIFT (24U)
#define ADC16_ADC16_CONFIG0_REG_EN_SET(x) (((uint32_t)(x) << ADC16_ADC16_CONFIG0_REG_EN_SHIFT) & ADC16_ADC16_CONFIG0_REG_EN_MASK)
#define ADC16_ADC16_CONFIG0_REG_EN_GET(x) (((uint32_t)(x) & ADC16_ADC16_CONFIG0_REG_EN_MASK) >> ADC16_ADC16_CONFIG0_REG_EN_SHIFT)

/*
 * BANDGAP_EN (RW)
 *
 * set to enable bandgap. user should set reg_en and bandgap_en before use adc16.
 */
#define ADC16_ADC16_CONFIG0_BANDGAP_EN_MASK (0x800000UL)
#define ADC16_ADC16_CONFIG0_BANDGAP_EN_SHIFT (23U)
#define ADC16_ADC16_CONFIG0_BANDGAP_EN_SET(x) (((uint32_t)(x) << ADC16_ADC16_CONFIG0_BANDGAP_EN_SHIFT) & ADC16_ADC16_CONFIG0_BANDGAP_EN_MASK)
#define ADC16_ADC16_CONFIG0_BANDGAP_EN_GET(x) (((uint32_t)(x) & ADC16_ADC16_CONFIG0_BANDGAP_EN_MASK) >> ADC16_ADC16_CONFIG0_BANDGAP_EN_SHIFT)

